---
kind: enumMember
id: F:Autodesk.Revit.DB.ConnectorProfileType.Oval
enum: Autodesk.Revit.DB.ConnectorProfileType
source: html/94482e32-e0e3-2340-c23c-6cef9348434e.htm
---
# Autodesk.Revit.DB.ConnectorProfileType.Oval

Oval connector profile